NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_flpr.svd
        <register>
          <name>VPRSTATUS</name>
          <description>VPR state information.</description>
          <addressOffset>0x804</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CPUSTATUS</name>
              <description>Enumerates one of several possible states for the VPR:</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAITING</name>
                  <description>WAITING (not yet started)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING</name>
                  <description>RUNNING</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEPING</name>
                  <description>SLEEPING</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>INTERRUPT (in handler)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXCEPTION_TRAP</name>
                  <description>EXCEPTION/TRAP (in handler)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONGOING_RESET</name>
                  <description>ONGOING_RESET</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALTED</name>
                  <description>HALTED</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>ERROR (lockup, needs debugging or reset)</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTPENABLED</name>
              <description>Mirrors the ENABLERTPERIPH bit in the NORDIC.VPRNORDICCTRL CSR</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Real-time peripherals disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Real-time peripherals enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTPSTALL</name>
              <description>Stalled waiting for real-time peripheral blocking CSR access, for example WAIT, OUTB with dirty status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotStalled</name>
                  <description>CPU not stalled on blocing CSR access.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stalled</name>
                  <description>CPU stalled on blocing CSR access.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INITPC</name>
          <description>Initial value of the PC at CPU start.</description>
          <addressOffset>0x808</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INITPC</name>
              <description>Initial value of the PC at CPU start.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_VPR00_NS">
      <name>GLOBAL_VPR00_S</name>
      <description>VPR peripheral registers 1</description>
      <baseAddress>0x5004C000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>VPR00</name>
        <value>76</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_GLITCHDET_S</name>
      <description>Voltage glitch detectors</description>
      <baseAddress>0x5004E000</baseAddress>
      <headerStructName>GLITCHDET</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>GLITCHDET</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CONFIG</name>
          <description>Configuration for glitch detector</description>
          <addressOffset>0x5A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable glitch detector</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable glitch detector</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable glitch detector</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Glitch detector mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HighPassFilter</name>
                  <description>High pass filter mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CapDiv</name>
                  <description>Cap divider mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
