NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_flpr.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_REGULATORS_NS</name>
      <description>Voltage regulators 0</description>
      <baseAddress>0x40120000</baseAddress>
      <alternatePeripheral>GLOBAL_OSCILLATORS_NS</alternatePeripheral>
      <headerStructName>REGULATORS</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>REGULATORS</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>HIBERNATOR</name>
          <description>Hibernator interface</description>
          <headerStructName>REGULATORS_HIBERNATOR</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>SYSTEMHIBERNATE</name>
            <description>Enter System hibernation mode for extreme low power consumption</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SYSTEMHIBERNATE</name>
                <description>Enter hibernation mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enter</name>
                    <description>Enter hibernation mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>GPIORETENTIONRELEASE</name>
            <description>Release GPIO retention on wake up from hibernation mode.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPIORETENTIONRELEASE</name>
                <description>Release GPIO retention</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoRelease</name>
                    <description>Do not release retention</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Release</name>
                    <description>Release retention</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>GPIORETENTIONSTATUS</name>
            <description>Read out if GPIO retention is active.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPIORETENTIONSTATUS</name>
                <description>Read out if GPIO retention is active.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotActive</name>
                    <description>GPIO retention is not active.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Active</name>
                    <description>GPIO retention is active.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>SYSTEMOFF</name>
          <description>System OFF register</description>
          <addressOffset>0x500</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYSTEMOFF</name>
              <description>Enable System OFF mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enter</name>
                  <description>Enable System OFF mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>POFCON</name>
          <description>Power-fail comparator configuration</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>POF</name>
              <description>Enable or disable power-fail comparator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THRESHOLD</name>
              <description>Power-fail comparator threshold setting</description>
              <lsb>1</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V090</name>
                  <description>Set threshold to 0.90 V for VDDL</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V095</name>
                  <description>Set threshold to 0.95 V for VDDL</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V100</name>
                  <description>Set threshold to 1.00 V for VDDL</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V105</name>
                  <description>Set threshold to 1.05 V for VDDL</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V110</name>
                  <description>Set threshold to 1.10 V for VDDL</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V115</name>
                  <description>Set threshold to 1.15 V for VDDL</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V120</name>
                  <description>Set threshold to 1.20 V for VDDL</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V125</name>
                  <description>Set threshold to 1.25 V for VDDL</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V130</name>
                  <description>Set threshold to 1.30 V for VDDL</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V135</name>
                  <description>Set threshold to 1.35 V for VDDL</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V140</name>
                  <description>Set threshold to 1.40 V for VDDL</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V145</name>
                  <description>Set threshold to 1.45 V for VDDL</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V150</name>
                  <description>Set threshold to 1.50 V for VDDL</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V155</name>
                  <description>Set threshold to 1.55 V for VDDL</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V160</name>
                  <description>Set threshold to 1.60 V for VDDL</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V165</name>
                  <description>Set threshold to 1.65 V for VDDL</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVENTDISABLE</name>
              <description>Disable the POFWARN power-fail warning event</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>POFWARN event is generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>POFWARN event is not generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSEL</name>
              <description>Power-fail comparator input selector</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VddL</name>
                  <description>POF input connected to VDDL</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>POFSTAT</name>
          <description>Power-fail comparator status register</description>
          <addressOffset>0x534</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMPARATOR</name>
              <description>Power-fail comparator status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Above</name>
                  <description>Voltage detected above VPOF threshold</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Below</name>
                  <description>Voltage detected below VPOF threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>VREGMAIN</name>
          <description>Register interface for main voltage regulator.</description>
          <headerStructName>REGULATORS_VREGMAIN</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>DCDCEN</name>
            <description>Enable DC/DC converter</description>
            <addressOffset>0x00</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Enable DC/DC buck converter</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable DC/DC buck converter</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable DC/DC converter</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>INDUCTORDET</name>
            <description>VREGMAIN inductor detection</description>
            <addressOffset>0x04</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DETECTED</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>InductorNotDetected</name>
                    <description>VREGMAIN inductor not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>InductorDetected</name>
                    <description>VREGMAIN inductor detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_OSCILLATORS_NS">
      <name>GLOBAL_OSCILLATORS_S</name>
      <description>Oscillator control 1</description>
      <baseAddress>0x50120000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_REGULATORS_NS">
      <name>GLOBAL_REGULATORS_S</name>
      <description>Voltage regulators 1</description>
      <baseAddress>0x50120000</baseAddress>
      <alternatePeripheral>GLOBAL_OSCILLATORS_S</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
  </peripherals>
</device>